GreatCowBASIC/DATFileGenerator/incfiles/OrgFiles/p18f47q10.inc
        LIST

;==========================================================================
; Build date : Oct 24 2019
;  MPASM PIC18F47Q10 processor include
; 
;  (c) Copyright 1999-2019 Microchip Technology, All rights reserved
;==========================================================================

        NOLIST

;==========================================================================
;  This header file defines configurations, registers, and other useful
;  bits of information for the PIC18F47Q10 microcontroller.  These names
;  are taken to match the data sheets as closely as possible.
;
;  Note that the processor must be selected before this file is included.
;  The processor may be selected the following ways:
;
;       1. Command line switch:
;               C:\MPASM MYFILE.ASM /PIC18F47Q10
;       2. LIST directive in the source file
;               LIST   P=PIC18F47Q10
;       3. Processor Type entry in the MPASM full-screen interface
;       4. Setting the processor in the MPLAB Project Dialog
;==========================================================================

;==========================================================================
;
;       Verify Processor
;
;==========================================================================
        IFNDEF __18F47Q10
           MESSG "Processor-header file mismatch.  Verify selected processor."
        ENDIF

;==========================================================================
;       18xxxx Family        EQUates
;==========================================================================
FSR0             EQU  0
FSR1             EQU  1
FSR2             EQU  2

FAST             EQU  1

W                EQU  0
A                EQU  0
ACCESS           EQU  0
BANKED           EQU  1
;==========================================================================

;==========================================================================
;       16Cxxx/17Cxxx Substitutions
;==========================================================================
  #define DDRA  TRISA      ; PIC17Cxxx SFR substitution
  #define DDRB  TRISB      ; PIC17Cxxx SFR substitution
  #define DDRC  TRISC      ; PIC17Cxxx SFR substitution
  #define DDRD  TRISD      ; PIC17Cxxx SFR substitution
  #define DDRE  TRISE      ; PIC17Cxxx SFR substitution

;==========================================================================
;
;       Register Definitions
;
;==========================================================================

;----- Register Files -----------------------------------------------------
CLCIN0PPS        EQU  H'0E1F'
CLCIN1PPS        EQU  H'0E20'
CLCIN2PPS        EQU  H'0E21'
CLCIN3PPS        EQU  H'0E22'
CLCIN4PPS        EQU  H'0E23'
CLCIN5PPS        EQU  H'0E24'
CLCIN6PPS        EQU  H'0E25'
CLCIN7PPS        EQU  H'0E26'
CLC1CON          EQU  H'0E27'
CLC1POL          EQU  H'0E28'
CLC1SEL0         EQU  H'0E29'
CLC1SEL1         EQU  H'0E2A'
CLC1SEL2         EQU  H'0E2B'
CLC1SEL3         EQU  H'0E2C'
CLC1GLS0         EQU  H'0E2D'
CLC1GLS1         EQU  H'0E2E'
CLC1GLS2         EQU  H'0E2F'
CLC1GLS3         EQU  H'0E30'
CLC2CON          EQU  H'0E31'
CLC2POL          EQU  H'0E32'
CLC2SEL0         EQU  H'0E33'
CLC2SEL1         EQU  H'0E34'
CLC2SEL2         EQU  H'0E35'
CLC2SEL3         EQU  H'0E36'
CLC2GLS0         EQU  H'0E37'
CLC2GLS1         EQU  H'0E38'
CLC2GLS2         EQU  H'0E39'
CLC2GLS3         EQU  H'0E3A'
CLC3CON          EQU  H'0E3B'
CLC3POL          EQU  H'0E3C'
CLC3SEL0         EQU  H'0E3D'
CLC3SEL1         EQU  H'0E3E'
CLC3SEL2         EQU  H'0E3F'
CLC3SEL3         EQU  H'0E40'
CLC3GLS0         EQU  H'0E41'
CLC3GLS1         EQU  H'0E42'
CLC3GLS2         EQU  H'0E43'
CLC3GLS3         EQU  H'0E44'
CLC4CON          EQU  H'0E45'
CLC4POL          EQU  H'0E46'
CLC4SEL0         EQU  H'0E47'
CLC4SEL1         EQU  H'0E48'
CLC4SEL2         EQU  H'0E49'
CLC4SEL3         EQU  H'0E4A'
CLC4GLS0         EQU  H'0E4B'
CLC4GLS1         EQU  H'0E4C'
CLC4GLS2         EQU  H'0E4D'
CLC4GLS3         EQU  H'0E4E'
CLC5CON          EQU  H'0E4F'
CLC5POL          EQU  H'0E50'
CLC5SEL0         EQU  H'0E51'
CLC5SEL1         EQU  H'0E52'
CLC5SEL2         EQU  H'0E53'
CLC5SEL3         EQU  H'0E54'
CLC5GLS0         EQU  H'0E55'
CLC5GLS1         EQU  H'0E56'
CLC5GLS2         EQU  H'0E57'
CLC5GLS3         EQU  H'0E58'
CLC6CON          EQU  H'0E59'
CLC6POL          EQU  H'0E5A'
CLC6SEL0         EQU  H'0E5B'
CLC6SEL1         EQU  H'0E5C'
CLC6SEL2         EQU  H'0E5D'
CLC6SEL3         EQU  H'0E5E'
CLC6GLS0         EQU  H'0E5F'
CLC6GLS1         EQU  H'0E60'
CLC6GLS2         EQU  H'0E61'
CLC6GLS3         EQU  H'0E62'
CLC7CON          EQU  H'0E63'
CLC7POL          EQU  H'0E64'
CLC7SEL0         EQU  H'0E65'
CLC7SEL1         EQU  H'0E66'
CLC7SEL2         EQU  H'0E67'
CLC7SEL3         EQU  H'0E68'
CLC7GLS0         EQU  H'0E69'
CLC7GLS1         EQU  H'0E6A'
CLC7GLS2         EQU  H'0E6B'
CLC7GLS3         EQU  H'0E6C'
CLC8CON          EQU  H'0E6D'
CLC8POL          EQU  H'0E6E'
CLC8SEL0         EQU  H'0E6F'
CLC8SEL1         EQU  H'0E70'
CLC8SEL2         EQU  H'0E71'
CLC8SEL3         EQU  H'0E72'
CLC8GLS0         EQU  H'0E73'
CLC8GLS1         EQU  H'0E74'
CLC8GLS2         EQU  H'0E75'
CLC8GLS3         EQU  H'0E76'
CLCDATA          EQU  H'0E77'
RX2PPS           EQU  H'0E88'
RXDT2PPS         EQU  H'0E88'
CK2PPS           EQU  H'0E89'
TX2PPS           EQU  H'0E89'
TXCK2PPS         EQU  H'0E89'
SSP2CLKPPS       EQU  H'0E8A'
SSP2DATPPS       EQU  H'0E8B'
SSP2SSPPS        EQU  H'0E8C'
SSP2BUF          EQU  H'0E8D'
SSP2ADD          EQU  H'0E8E'
SSP2MSK          EQU  H'0E8F'
SSP2STAT         EQU  H'0E90'
SSP2CON1         EQU  H'0E91'
SSP2CON2         EQU  H'0E92'
SSP2CON3         EQU  H'0E93'
RC2REG           EQU  H'0E94'
RCREG2           EQU  H'0E94'
TX2REG           EQU  H'0E95'
TXREG2           EQU  H'0E95'
SP2BRG           EQU  H'0E96'
SP2BRGL          EQU  H'0E96'
SPBRG2           EQU  H'0E96'
SP2BRGH          EQU  H'0E97'
SPBRGH2          EQU  H'0E97'
RC2STA           EQU  H'0E98'
RCSTA2           EQU  H'0E98'
TX2STA           EQU  H'0E99'
TXSTA2           EQU  H'0E99'
BAUD2CON         EQU  H'0E9A'
BAUDCON2         EQU  H'0E9A'
BAUDCTL2         EQU  H'0E9A'
PPSLOCK          EQU  H'0E9B'
INT0PPS          EQU  H'0E9C'
INT1PPS          EQU  H'0E9D'
INT2PPS          EQU  H'0E9E'
T0CKIPPS         EQU  H'0E9F'
T1CKIPPS         EQU  H'0EA0'
T1GPPS           EQU  H'0EA1'
T3CKIPPS         EQU  H'0EA2'
T3GPPS           EQU  H'0EA3'
T5CKIPPS         EQU  H'0EA4'
T5GPPS           EQU  H'0EA5'
T2INPPS          EQU  H'0EA6'
T4INPPS          EQU  H'0EA7'
T6INPPS          EQU  H'0EA8'
ADACTPPS         EQU  H'0EA9'
CCP1PPS          EQU  H'0EAA'
CCP2PPS          EQU  H'0EAB'
CWG1INPPS        EQU  H'0EAC'
CWG1PPS          EQU  H'0EAC'
CWGINPPS         EQU  H'0EAC'
CWGPPS           EQU  H'0EAC'
MDCARLPPS        EQU  H'0EAD'
MDCARHPPS        EQU  H'0EAE'
MDSRCPPS         EQU  H'0EAF'
RX1PPS           EQU  H'0EB0'
RXDT1PPS         EQU  H'0EB0'
RXPPS            EQU  H'0EB0'
CK1PPS           EQU  H'0EB1'
CKPPS            EQU  H'0EB1'
TX1PPS           EQU  H'0EB1'
TXCK1PPS         EQU  H'0EB1'
TXPPS            EQU  H'0EB1'
SSP1CLKPPS       EQU  H'0EB2'
SSPCLKPPS        EQU  H'0EB2'
SSP1DATPPS       EQU  H'0EB3'
SSPDATPPS        EQU  H'0EB3'
SSP1SSPPS        EQU  H'0EB4'
SSPSSPPS         EQU  H'0EB4'
IPR0             EQU  H'0EB5'
IPR1             EQU  H'0EB6'
IPR2             EQU  H'0EB7'
IPR3             EQU  H'0EB8'
IPR4             EQU  H'0EB9'
IPR5             EQU  H'0EBA'
IPR6             EQU  H'0EBB'
IPR7             EQU  H'0EBC'
PIE0             EQU  H'0EBD'
PIE1             EQU  H'0EBE'
PIE2             EQU  H'0EBF'
PIE3             EQU  H'0EC0'
PIE4             EQU  H'0EC1'
PIE5             EQU  H'0EC2'
PIE6             EQU  H'0EC3'
PIE7             EQU  H'0EC4'
PIR0             EQU  H'0EC5'
PIR1             EQU  H'0EC6'
PIR2             EQU  H'0EC7'
PIR3             EQU  H'0EC8'
PIR4             EQU  H'0EC9'
PIR5             EQU  H'0ECA'
PIR6             EQU  H'0ECB'
PIR7             EQU  H'0ECC'
WDTCON0          EQU  H'0ECD'
WDTCON1          EQU  H'0ECE'
WDTPSL           EQU  H'0ECF'
WDTPSH           EQU  H'0ED0'
WDTTMR           EQU  H'0ED1'
CPUDOZE          EQU  H'0ED2'
OSCCON1          EQU  H'0ED3'
OSCCON2          EQU  H'0ED4'
OSCCON3          EQU  H'0ED5'
OSCSTAT          EQU  H'0ED6'
OSCSTAT1         EQU  H'0ED6'
OSCEN            EQU  H'0ED7'
OSCTUNE          EQU  H'0ED8'
OSCFREQ          EQU  H'0ED9'
OSCFRQ           EQU  H'0ED9'
VREGCON          EQU  H'0EDA'
BORCON           EQU  H'0EDB'
PMD0             EQU  H'0EDC'
PMD1             EQU  H'0EDD'
PMD2             EQU  H'0EDE'
PMD3             EQU  H'0EDF'
PMD4             EQU  H'0EE0'
PMD5             EQU  H'0EE1'
RA0PPS           EQU  H'0EE2'
RA1PPS           EQU  H'0EE3'
RA2PPS           EQU  H'0EE4'
RA3PPS           EQU  H'0EE5'
RA4PPS           EQU  H'0EE6'
RA5PPS           EQU  H'0EE7'
RA6PPS           EQU  H'0EE8'
RA7PPS           EQU  H'0EE9'
RB0PPS           EQU  H'0EEA'
RB1PPS           EQU  H'0EEB'
RB2PPS           EQU  H'0EEC'
RB3PPS           EQU  H'0EED'
RB4PPS           EQU  H'0EEE'
RB5PPS           EQU  H'0EEF'
RB6PPS           EQU  H'0EF0'
RB7PPS           EQU  H'0EF1'
RC0PPS           EQU  H'0EF2'
RC1PPS           EQU  H'0EF3'
RC2PPS           EQU  H'0EF4'
RC3PPS           EQU  H'0EF5'
RC4PPS           EQU  H'0EF6'
RC5PPS           EQU  H'0EF7'
RC6PPS           EQU  H'0EF8'
RC7PPS           EQU  H'0EF9'
RD0PPS           EQU  H'0EFA'
RD1PPS           EQU  H'0EFB'
RD2PPS           EQU  H'0EFC'
RD3PPS           EQU  H'0EFD'
RD4PPS           EQU  H'0EFE'
RD5PPS           EQU  H'0EFF'
RD6PPS           EQU  H'0F00'
RD7PPS           EQU  H'0F01'
RE0PPS           EQU  H'0F02'
RE1PPS           EQU  H'0F03'
RE2PPS           EQU  H'0F04'
IOCAF            EQU  H'0F05'
IOCAN            EQU  H'0F06'
IOCAP            EQU  H'0F07'
INLVLA           EQU  H'0F08'
SLRCONA          EQU  H'0F09'
ODCONA           EQU  H'0F0A'
WPUA             EQU  H'0F0B'
ANSELA           EQU  H'0F0C'
IOCBF            EQU  H'0F0D'
IOCBN            EQU  H'0F0E'
IOCBP            EQU  H'0F0F'
INLVLB           EQU  H'0F10'
SLRCONB          EQU  H'0F11'
ODCONB           EQU  H'0F12'
WPUB             EQU  H'0F13'
ANSELB           EQU  H'0F14'
IOCCF            EQU  H'0F15'
IOCCN            EQU  H'0F16'
IOCCP            EQU  H'0F17'
INLVLC           EQU  H'0F18'
SLRCONC          EQU  H'0F19'
ODCONC           EQU  H'0F1A'
WPUC             EQU  H'0F1B'
ANSELC           EQU  H'0F1C'
INLVLD           EQU  H'0F1D'
SLRCOND          EQU  H'0F1E'
ODCOND           EQU  H'0F1F'
WPUD             EQU  H'0F20'
ANSELD           EQU  H'0F21'
IOCEF            EQU  H'0F22'
IOCEN            EQU  H'0F23'
IOCEP            EQU  H'0F24'
INLVLE           EQU  H'0F25'
SLRCONE          EQU  H'0F26'
ODCONE           EQU  H'0F27'
WPUE             EQU  H'0F28'
ANSELE           EQU  H'0F29'
HLVDCON0         EQU  H'0F2A'
HLVDCON1         EQU  H'0F2B'
FVRCON           EQU  H'0F2C'
ZCDCON           EQU  H'0F2D'
DAC1CON0         EQU  H'0F2E'
DAC1CON1         EQU  H'0F2F'
CM2CON0          EQU  H'0F30'
CM2CON1          EQU  H'0F31'
CM2NCH           EQU  H'0F32'
CM2PCH           EQU  H'0F33'
CM1CON0          EQU  H'0F34'
CM1CON1          EQU  H'0F35'
CM1NCH           EQU  H'0F36'
CM1PCH           EQU  H'0F37'
CMOUT            EQU  H'0F38'
CLKRCON          EQU  H'0F39'
CLKRCLK          EQU  H'0F3A'
CWG1CLK          EQU  H'0F3B'
CWG1CLKCON       EQU  H'0F3B'
CWG1ISM          EQU  H'0F3C'
CWG1DBR          EQU  H'0F3D'
CWG1DBF          EQU  H'0F3E'
CWG1CON0         EQU  H'0F3F'
CWG1CON1         EQU  H'0F40'
CWG1AS0          EQU  H'0F41'
CWG1AS1          EQU  H'0F42'
CWG1STR          EQU  H'0F43'
SCANLADR         EQU  H'0F44'
SCANLADRL        EQU  H'0F44'
SCANLADRH        EQU  H'0F45'
SCANLADRU        EQU  H'0F46'
SCANHADR         EQU  H'0F47'
SCANHADRL        EQU  H'0F47'
SCANHADRH        EQU  H'0F48'
SCANHADRU        EQU  H'0F49'
SCANCON0         EQU  H'0F4A'
SCANTRIG         EQU  H'0F4B'
MDCON0           EQU  H'0F4C'
MDCON1           EQU  H'0F4D'
MDSRC            EQU  H'0F4E'
MDCARL           EQU  H'0F4F'
MDCARH           EQU  H'0F50'
ADACT            EQU  H'0F51'
ADCLK            EQU  H'0F52'
ADREF            EQU  H'0F53'
ADCON1           EQU  H'0F54'
ADCON2           EQU  H'0F55'
ADCON3           EQU  H'0F56'
ADACQ            EQU  H'0F57'
ADCAP            EQU  H'0F58'
ADPRE            EQU  H'0F59'
ADPCH            EQU  H'0F5A'
ADCON0           EQU  H'0F5B'
ADPREV           EQU  H'0F5C'
ADPREVL          EQU  H'0F5C'
ADPREVH          EQU  H'0F5D'
ADRES            EQU  H'0F5E'
ADRESL           EQU  H'0F5E'
ADRESH           EQU  H'0F5F'
ADSTAT           EQU  H'0F60'
ADRPT            EQU  H'0F61'
ADCNT            EQU  H'0F62'
ADSTPT           EQU  H'0F63'
ADSTPTL          EQU  H'0F63'
ADSTPTH          EQU  H'0F64'
ADLTH            EQU  H'0F65'
ADLTHL           EQU  H'0F65'
ADLTHH           EQU  H'0F66'
ADUTH            EQU  H'0F67'
ADUTHL           EQU  H'0F67'
ADUTHH           EQU  H'0F68'
ADERR            EQU  H'0F69'
ADERRL           EQU  H'0F69'
ADERRH           EQU  H'0F6A'
ADACC            EQU  H'0F6B'
ADACCL           EQU  H'0F6B'
ADACCH           EQU  H'0F6C'
ADFLTR           EQU  H'0F6D'
ADFLTRL          EQU  H'0F6D'
ADFLTRH          EQU  H'0F6E'
CRCDATA          EQU  H'0F6F'
CRCDATL          EQU  H'0F6F'
CRCDATH          EQU  H'0F70'
CRCACC           EQU  H'0F71'
CRCACCL          EQU  H'0F71'
CRCACCH          EQU  H'0F72'
CRCSHFT          EQU  H'0F73'
CRCSHIFTL        EQU  H'0F73'
CRCSHIFTH        EQU  H'0F74'
CRCXOR           EQU  H'0F75'
CRCXORL          EQU  H'0F75'
CRCXORH          EQU  H'0F76'
CRCCON0          EQU  H'0F77'
CRCCON1          EQU  H'0F78'
NVMADR           EQU  H'0F79'
NVMADRL          EQU  H'0F79'
NVMADRH          EQU  H'0F7A'
NVMADRU          EQU  H'0F7B'
NVMDAT           EQU  H'0F7C'
NVMDATL          EQU  H'0F7C'
NVMDATH          EQU  H'0F7D'
NVMCON0          EQU  H'0F7F'
NVMCON1          EQU  H'0F80'
NVMCON2          EQU  H'0F81'
LATA             EQU  H'0F82'
LATB             EQU  H'0F83'
LATC             EQU  H'0F84'
LATD             EQU  H'0F85'
LATE             EQU  H'0F86'
DDRA             EQU  H'0F87'
TRISA            EQU  H'0F87'
DDRB             EQU  H'0F88'
TRISB            EQU  H'0F88'
DDRC             EQU  H'0F89'
TRISC            EQU  H'0F89'
DDRD             EQU  H'0F8A'
TRISD            EQU  H'0F8A'
DDRE             EQU  H'0F8B'
TRISE            EQU  H'0F8B'
PORTA            EQU  H'0F8C'
PORTB            EQU  H'0F8D'
PORTC            EQU  H'0F8E'
PORTD            EQU  H'0F8F'
PORTE            EQU  H'0F90'
SSP1BUF          EQU  H'0F91'
SSP1ADD          EQU  H'0F92'
SSP1MSK          EQU  H'0F93'
SSP1STAT         EQU  H'0F94'
SSP1CON1         EQU  H'0F95'
SSP1CON2         EQU  H'0F96'
SSP1CON3         EQU  H'0F97'
RC1REG           EQU  H'0F98'
RCREG            EQU  H'0F98'
RCREG1           EQU  H'0F98'
TX1REG           EQU  H'0F99'
TXREG            EQU  H'0F99'
TXREG1           EQU  H'0F99'
SP1BRG           EQU  H'0F9A'
SP1BRGL          EQU  H'0F9A'
SPBRG            EQU  H'0F9A'
SPBRG1           EQU  H'0F9A'
SPBRGL           EQU  H'0F9A'
SP1BRGH          EQU  H'0F9B'
SPBRGH           EQU  H'0F9B'
SPBRGH1          EQU  H'0F9B'
RC1STA           EQU  H'0F9C'
RCSTA            EQU  H'0F9C'
RCSTA1           EQU  H'0F9C'
TX1STA           EQU  H'0F9D'
TXSTA            EQU  H'0F9D'
TXSTA1           EQU  H'0F9D'
BAUD1CON         EQU  H'0F9E'
BAUDCON          EQU  H'0F9E'
BAUDCON1         EQU  H'0F9E'
BAUDCTL          EQU  H'0F9E'
BAUDCTL1         EQU  H'0F9E'
PWM4DC           EQU  H'0F9F'
PWM4DCL          EQU  H'0F9F'
PWM4DCH          EQU  H'0FA0'
PWM4CON          EQU  H'0FA1'
PWM3DC           EQU  H'0FA2'
PWM3DCL          EQU  H'0FA2'
PWM3DCH          EQU  H'0FA3'
PWM3CON          EQU  H'0FA4'
CCPR2            EQU  H'0FA5'
CCPR2L           EQU  H'0FA5'
CCPR2H           EQU  H'0FA6'
CCP2CON          EQU  H'0FA7'
CCP2CAP          EQU  H'0FA8'
CCPR1            EQU  H'0FA9'
CCPR1L           EQU  H'0FA9'
CCPR1H           EQU  H'0FAA'
CCP1CON          EQU  H'0FAB'
CCP1CAP          EQU  H'0FAC'
CCPTMRS          EQU  H'0FAD'
T6TMR            EQU  H'0FAE'
TMR6             EQU  H'0FAE'
PR6              EQU  H'0FAF'
T6PR             EQU  H'0FAF'
T6CON            EQU  H'0FB0'
T6HLT            EQU  H'0FB1'
T6CLK            EQU  H'0FB2'
T6CLKCON         EQU  H'0FB2'
T6RST            EQU  H'0FB3'
T4TMR            EQU  H'0FB4'
TMR4             EQU  H'0FB4'
PR4              EQU  H'0FB5'
T4PR             EQU  H'0FB5'
T4CON            EQU  H'0FB6'
T4HLT            EQU  H'0FB7'
T4CLK            EQU  H'0FB8'
T4CLKCON         EQU  H'0FB8'
T4RST            EQU  H'0FB9'
T2TMR            EQU  H'0FBA'
TMR2             EQU  H'0FBA'
PR2              EQU  H'0FBB'
T2PR             EQU  H'0FBB'
T2CON            EQU  H'0FBC'
T2HLT            EQU  H'0FBD'
T2CLK            EQU  H'0FBE'
T2CLKCON         EQU  H'0FBE'
T2RST            EQU  H'0FBF'
TMR5             EQU  H'0FC0'
TMR5L            EQU  H'0FC0'
TMR5H            EQU  H'0FC1'
T5CON            EQU  H'0FC2'
PR5              EQU  H'0FC3'
T5GCON           EQU  H'0FC3'
T5GATE           EQU  H'0FC4'
TMR5GATE         EQU  H'0FC4'
T5CLK            EQU  H'0FC5'
TMR5CLK          EQU  H'0FC5'
TMR3             EQU  H'0FC6'
TMR3L            EQU  H'0FC6'
TMR3H            EQU  H'0FC7'
T3CON            EQU  H'0FC8'
PR3              EQU  H'0FC9'
T3GCON           EQU  H'0FC9'
T3GATE           EQU  H'0FCA'
TMR3GATE         EQU  H'0FCA'
T3CLK            EQU  H'0FCB'
TMR3CLK          EQU  H'0FCB'
TMR1             EQU  H'0FCC'
TMR1L            EQU  H'0FCC'
TMR1H            EQU  H'0FCD'
T1CON            EQU  H'0FCE'
PR1              EQU  H'0FCF'
T1GCON           EQU  H'0FCF'
T1GATE           EQU  H'0FD0'
TMR1GATE         EQU  H'0FD0'
T1CLK            EQU  H'0FD1'
TMR1CLK          EQU  H'0FD1'
TMR0             EQU  H'0FD2'
TMR0L            EQU  H'0FD2'
PR0              EQU  H'0FD3'
TMR0H            EQU  H'0FD3'
T0CON0           EQU  H'0FD4'
T0CON1           EQU  H'0FD5'
PCON1            EQU  H'0FD6'
PCON0            EQU  H'0FD7'
STATUS           EQU  H'0FD8'
FSR2L            EQU  H'0FD9'
FSR2H            EQU  H'0FDA'
PLUSW2           EQU  H'0FDB'
PREINC2          EQU  H'0FDC'
POSTDEC2         EQU  H'0FDD'
POSTINC2         EQU  H'0FDE'
INDF2            EQU  H'0FDF'
BSR              EQU  H'0FE0'
FSR1L            EQU  H'0FE1'
FSR1H            EQU  H'0FE2'
PLUSW1           EQU  H'0FE3'
PREINC1          EQU  H'0FE4'
POSTDEC1         EQU  H'0FE5'
POSTINC1         EQU  H'0FE6'
INDF1            EQU  H'0FE7'
WREG             EQU  H'0FE8'
FSR0L            EQU  H'0FE9'
FSR0H            EQU  H'0FEA'
PLUSW0           EQU  H'0FEB'
PREINC0          EQU  H'0FEC'
POSTDEC0         EQU  H'0FED'
POSTINC0         EQU  H'0FEE'
INDF0            EQU  H'0FEF'
INTCON           EQU  H'0FF2'
PROD             EQU  H'0FF3'
PRODL            EQU  H'0FF3'
PRODH            EQU  H'0FF4'
TABLAT           EQU  H'0FF5'
TBLPTR           EQU  H'0FF6'
TBLPTRL          EQU  H'0FF6'
TBLPTRH          EQU  H'0FF7'
TBLPTRU          EQU  H'0FF8'
PC               EQU  H'0FF9'
PCL              EQU  H'0FF9'
PCLATH           EQU  H'0FFA'
PCLATU           EQU  H'0FFB'
STKPTR           EQU  H'0FFC'
TOS              EQU  H'0FFD'
TOSL             EQU  H'0FFD'
TOSH             EQU  H'0FFE'
TOSU             EQU  H'0FFF'

;----- CLCIN0PPS Bits -----------------------------------------------------
CLCIN0PPS0       EQU  H'0000'
CLCIN0PPS1       EQU  H'0001'
CLCIN0PPS2       EQU  H'0002'
CLCIN0PPS3       EQU  H'0003'
CLCIN0PPS4       EQU  H'0004'



;----- CLCIN1PPS Bits -----------------------------------------------------
CLCIN1PPS0       EQU  H'0000'
CLCIN1PPS1       EQU  H'0001'
CLCIN1PPS2       EQU  H'0002'
CLCIN1PPS3       EQU  H'0003'
CLCIN1PPS4       EQU  H'0004'



;----- CLCIN2PPS Bits -----------------------------------------------------
CLCIN2PPS0       EQU  H'0000'
CLCIN2PPS1       EQU  H'0001'
CLCIN2PPS2       EQU  H'0002'
CLCIN2PPS3       EQU  H'0003'
CLCIN2PPS4       EQU  H'0004'



;----- CLCIN3PPS Bits -----------------------------------------------------
CLCIN3PPS0       EQU  H'0000'
CLCIN3PPS1       EQU  H'0001'
CLCIN3PPS2       EQU  H'0002'
CLCIN3PPS3       EQU  H'0003'
CLCIN3PPS4       EQU  H'0004'



;----- CLCIN4PPS Bits -----------------------------------------------------
CLCIN4PPS0       EQU  H'0000'
CLCIN4PPS1       EQU  H'0001'
CLCIN4PPS2       EQU  H'0002'
CLCIN4PPS3       EQU  H'0003'
CLCIN4PPS4       EQU  H'0004'



;----- CLCIN5PPS Bits -----------------------------------------------------
CLCIN5PPS0       EQU  H'0000'
CLCIN5PPS1       EQU  H'0001'
CLCIN5PPS2       EQU  H'0002'
CLCIN5PPS3       EQU  H'0003'
CLCIN5PPS4       EQU  H'0004'



;----- CLCIN6PPS Bits -----------------------------------------------------
CLCIN6PPS0       EQU  H'0000'
CLCIN6PPS1       EQU  H'0001'
CLCIN6PPS2       EQU  H'0002'
CLCIN6PPS3       EQU  H'0003'
CLCIN6PPS4       EQU  H'0004'



;----- CLCIN7PPS Bits -----------------------------------------------------
CLCIN7PPS0       EQU  H'0000'
CLCIN7PPS1       EQU  H'0001'
CLCIN7PPS2       EQU  H'0002'
CLCIN7PPS3       EQU  H'0003'
CLCIN7PPS4       EQU  H'0004'



